{
  "lang": "pl",
  "about_me": "O mnie",
  "about": "Wysoce zmotywowany inżynier IT z solidnymi podstawami w zakresie tworzenia stron internetowych i zarządzania bazami danych. Biegle posługuję się językami JavaScript, PHP, SQL, .NET i Python, a także mam praktyczne doświadczenie z nowoczesnymi frameworkami i narzędziami takimi jak React, Next.js i Laravel. Zrealizowałem różnorodne projekty z wykorzystaniem tych technologii — od narzędzi do analizy CV i oprogramowania do rozpoznawania osób, po w pełni funkcjonalne serwisy streamingowe, sklepy internetowe, platformę z grami przeglądarkowymi dla wielu graczy, a nawet gry stworzone w Unity. Chętnie wykorzystam swoje umiejętności rozwiązywania problemów i szybkie przyswajanie wiedzy, aby wspierać innowacyjne projekty. Dodatkowo rozwijam się w obszarze sztucznej inteligencji i uczenia maszynowego. Pracowałem z modelami NLP, analizą obrazów oraz algorytmami predykcyjnymi, wykorzystując narzędzia takie jak TensorFlow i PyTorch. Tworzę rozwiązania AI wspierające automatyzację i przetwarzanie danych. Umiejętnie łączę wiedzę programistyczną z praktycznym podejściem do nowoczesnych technologii AI.",
   "hi": "Cześć, jestem",
   "itexp": "Ekspert IT",
   "About": "O mnie",
   "Technologies": "Technologie",
   "Skills": "Umiejętności",
   "Projects": "Projekty",
   "Experience": "Doświadczenie",
   "Contact": "Kontakt",
   "PROBLEM-SOLVING": "ROZWIĄZYWANIE PROBLEMÓW",
   "FAST LEARNER": "SZYBKO SIĘ UCZĘ",
   "FAMILIAR WITH GIT AND GITHUB": "ZNAJOMOŚĆ GIT I GITHUB",
   "KNOW HOW OF PRINCE AND AGILE METODOLOGY": "ZNAJOMOŚĆ METODOLOGII PRINCE2 I AGILE",
   "DEPENDABLE AND RESPONSIBLE": "GODNY ZAUFANIA I ODPOWIEDZIALNY",
   "OWNS A DRIVERS LICENSE": "POSIADA PRAWO JAZDY",
   "TEAMWORK": "PRACA ZESPOŁOWA",
   "ADAPTABILITY": "ELASTYCZNOŚĆ",
   "HARDWORKING": "PRACOWITOŚĆ",
   "Name": "Imię",
   "Email": "Email",
   "Message": "Wiadomość",
   "Send": "Wyślij",
   "Your name": "Twoje imię",
   "Your email": "Twój email",
   "Your message here...": "Twoja wiadomość tutaj...",
   "Education": "Wykształcenie",
   "Student": "Student",
   "Studied computer science with a focus on technical fundamentals.": "Studia informatyki z naciskiem na podstawy techniczne.",
   "Completed a Bachelor of Engineering degree in Computer Science with a specialization in Database Design and Application Software, graduating with a final grade of 5.0 (excellent).": "Ukończyłem studia I stopnia (inżynierskie) z informatyki ze specjalnością projektowanie baz danych i oprogramowanie użytkowe, uzyskując ocenę końcową 5.",
   "Front-end developer": "Programista front-end",
   "Focused on front-end development, gaining hands-on experience and working to improve and develop new skills in this area.": "Skoncentrowany na tworzeniu front-endu, zdobywam praktyczne doświadczenie i stale rozwijam oraz doskonalę umiejętności w tym obszarze.",
   "An interactive portfolio for architects showcasing their skills and experience." :"Interaktywne portfolio dla architektów prezentujące ich umiejętności i doświadczenie.",
   "Portfolio for architects": "Portfolio dla architektów",
   "RecruitHelper – AI-Powered Recruitment Platform" : "Platforma rekrutacyjna AI",
   "An AI-enhanced platform streamlining candidate matching and recruitment process.": "Platforma wspomagana sztuczną inteligencją, usprawniająca dopasowywanie kandydatów i proces rekrutacji.",
   "Next.js E-commerce Shop ": "Sklep internetowy z Next.js",
   "Fully functional online store built with Next.js and Stripe integration." :"W pełni funkcjonalny sklep online zbudowany w Next.js z integracją Stripe.",
   "Laravel Streaming Service": "Serwis streamingowy w Laravelu",
  "Platform for watching cartoons, including authentication and video hosting." : "Platforma do oglądania kreskówek, zawierająca uwierzytelnianie i hosting wideo.",
  "BMI Calculator – C# WinForms" : "Kalkulator BMI – C# WinForms",
   "Simple desktop app to calculate BMI with real-time feedback and health ranges." : "Prosta aplikacja desktopowa do obliczania BMI z bieżącą informacją zwrotną i zakresami zdrowotnymi.",
    "Laravel Gaming Hub with Multiplayer" : "portal gamingowy",
    "Gaming portal with user accounts, real-time multiplayer games, and leaderboard." : "Portal gier z kontami użytkowników, grami wieloosobowymi w czasie rzeczywistym i tablicą wyników.",
    "Android Remote Car Controller App": "Aplikacja do zdalnego sterowania samochodem",
    "Mobile app allowing remote control of a car prototype via Bluetooth." :"Aplikacja mobilna umożliwiająca zdalne sterowanie przez Bluetooth.", 
     "Python Image Person Recognizer": "Pythonowy rozpoznawacz osób na obrazach",
    "ML-based tool for detecting and recognizing persons in static images.": "Narzędzie oparte na uczeniu maszynowym do wykrywania i rozpoznawania osób na statycznych obrazach.",
   "Anime Face Detector AI Model" : "Model AI do wykrywania twarzy z anime",
    "Neural network model for detecting anime faces in image datasets.": "Model sieci neuronowej służący do wykrywania twarzy z anime w zbiorach obrazów.",
   "ASP.NET Streaming Service":"Serwis streamingowy w ASP.NET",
    "Modern streaming site with ASP.NET backend and media playback features.":"Nowoczesna strona streamingowa z backendem w ASP.NET i funkcjami odtwarzania multimediów.",
    "Escape Horror Game – Unity 3D" :"Escape Horror Game – Unity 3D",
    "Immersive 3D horror game with puzzles and atmospheric tension." :"Wciągająca gra horror 3D z zagadkami i atmosferycznym napięciem.",
    "ANS AI Demo – React + Three.js" :"ANS AI Demo – React + Three.js",
    "Interactive 3D AI demonstration using WebGL and FastAPI with Python backend." :"Interaktywna prezentacja AI 3D wykorzystująca WebGL oraz FastAPI z backendem w Pythonie.",
    "3D Developer Portfolio" :"Portfolio developera - 3D",
    "Personal portfolio built in 3D with animations and project showcase.":"Osobiste portfolio stworzone w 3D z animacjami i prezentacją projektów.",
    "User Management System" :"System zarządzania użytkownikami",
    "Admin panel to manage users with filters, pagination, and mock API." :"Panel administracyjny do zarządzania użytkownikami z filtrami",
    "React+PHP Cantor" : "React+PHP Kantor",
    "A simple app that conects to NBP API and displays data and history of currency rates." : "Prosta aplikacja połączająca się z NBP API i wyświetlająca dane i historię kursów walut."
  }